src/cf/InformationRegisters/ИдентификаторыПоследнихОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПоследнихОбновлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БотыТелеграм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыПоследнихОбновлений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПоследнийИдентификатор(Бот) Экспорт
	Идентификатор = Неопределено;
	
	МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоследнихОбновлений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Идентификатор = МенеджерЗаписи.Идентификатор;
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Процедура ОбновитьПоследнийИдентификатор(Бот, Идентификатор) Экспорт
	МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоследнихОбновлений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
